20240623T212808--kdoc-193-プログラミング言語は共通言語として役立つ__essay.org
:properties:
:ID: 20240623T212808
:mtime:    20250626233333
:ctime:    20241028101410
:end:
#+title:      KDOC 193: プログラミング言語は共通言語として役立つ
#+date:       [2024-06-23 Sun 21:28]
#+filetags:   :essay:
#+identifier: 20240623T212808

* この文書のステータス
- 作成
  - [X] 2024-06-23 貴島
- レビュー
  - [X] 2024-06-30 貴島

* 概要
[[id:20240612T133312][KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』]]で、感銘を受けた。あたりまえに使うクラス、ハッシュ、ブロック...などが、どうやって実装されているかについてバーチャルマシン命令レベルで解説している。時間をかけて咀嚼し、腑に落ちる感じがあった。

[[id:cfd092c4-1bb2-43d3-88b1-9f647809e546][Ruby]]に取り組んだ経験がなかったら、この感動は得られなかっただろう。プログラミング言語には、単に実装のためだけでなく、先人の知見を学ぶ共通言語として役立つ面がある。特定の領域知識は、プログラミング言語によって偏って存在している。もしX言語しかやらない、と決め打ちしていたら、機会損失する可能性がある。

* 関連
- [[id:20240529T002323][KDOC 179: 『ハロー“Hello, World” OSと標準ライブラリのシゴトとしくみ』]]でも、別の実装を見て比較してみる重要性が説かれていた
- [[id:20240612T133312][KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』]]を読んでいて考えたこと
