20240623T212808--kdoc-193-プログラミング言語は共通言語として役立つ__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:18:40Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 193: プログラミング言語は共通言語として役立つ</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 193: プログラミング言語は共通言語として役立つ</h1>
<div id="outline-container-org05107e4" class="outline-2">
<h2 id="org05107e4"><a href="#org05107e4">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org05107e4">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-06-23 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-06-30 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9ff3607" class="outline-2">
<h2 id="org9ff3607"><a href="#org9ff3607">概要</a></h2>
<div class="outline-text-2" id="text-org9ff3607">
<p>
<a href="20240612T133312--kdoc-190-『rubyのしくみ-ruby-under-a-microscope』__book.html#ID-20240612T133312">KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』</a>で、感銘を受けた。あたりまえに使うクラス、ハッシュ、ブロック&#x2026;などが、どうやって実装されているかについてバーチャルマシン命令レベルで解説している。時間をかけて咀嚼し、腑に落ちる感じがあった。
</p>

<p>
<a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>に取り組んだ経験がなかったら、この感動は得られなかっただろう。プログラミング言語には、単に実装のためだけでなく、先人の知見を学ぶ共通言語として役立つ面がある。特定の領域知識は、プログラミング言語によって偏って存在している。もしX言語しかやらない、と決め打ちしていたら、機会損失する可能性がある。
</p>
</div>
</div>
<div id="outline-container-org9511be5" class="outline-2">
<h2 id="org9511be5"><a href="#org9511be5">関連</a></h2>
<div class="outline-text-2" id="text-org9511be5">
<ul class="org-ul">
<li><a href="20240529T002323--kdoc-179-『ハローhello-world-osと標準ライブラリのシゴトとしくみ』__book.html#ID-20240529T002323">KDOC 179: 『ハロー“Hello, World” OSと標準ライブラリのシゴトとしくみ』</a>でも、別の実装を見て比較してみる重要性が説かれていた</li>
<li><a href="20240612T133312--kdoc-190-『rubyのしくみ-ruby-under-a-microscope』__book.html#ID-20240612T133312">KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』</a>を読んでいて考えたこと</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
